finHome/Documents/СписанияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписанияДС</Name>
			<Comment>Списания денежных средств</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СписанияДС</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Списания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленСемьи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоставСемьи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

finHome/Documents/СписанияДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЭтаФорма.ВыборРасшифровки = 1;
		Возврат;	
	КонецЕсли;  
	
	Если Объект.Списания.Количество() = 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 1;
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
        ЗаполнитьПоляГруппыБезРасшифровки();
	ИначеЕсли Объект.Списания.Количество() > 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 2;
		ЭтаФорма.Элементы.Группа1.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
	КонецЕсли;      
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиЭлементовФормы
&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	Если ВыборРасшифровки = 1 Тогда
		ЭтаФорма.Элементы.Группа1.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЗаполнитьПоляГруппыБезРасшифровки();
	Иначе
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЗаполнитьРасшифровкуСписком();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзменении(Элемент)  
	
	РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияВидДСПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСтатьяРасходовПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСтатьяРасходовПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСуммаПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере(); 
	
КонецПроцедуры
#КонецОбласти

#Область Служебные
&НаСервере
Процедура РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	Иначе
		Объект.Списания[0].ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСтатьяРасходовПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.СтатьяРасходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов;
	Иначе
		Объект.Списания[0].СтатьяРасходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	Иначе
		Объект.Списания[0].Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоляГруппыБезРасшифровки()
	
	ЭтотОбъект.РасшифровкаБезРазбиенияВидДС = Объект.Списания[0].ВидДС;
	ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов = Объект.Списания[0].СтатьяРасходов;
	ЭтотОбъект.РасшифровкаБезРазбиенияСумма = Объект.Списания[0].Сумма;
	ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи = Объект.Списания[0].ЧленСемьи;
	ЗаполнитьРасшифровкуСписком();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРасшифровкуСписком() 
	
	Объект.Списания.Очистить();
	НСтр = Объект.Списания.Добавить();
	НСтр.ВидДС = РасшифровкаБезРазбиенияВидДС;
	НСтр.СтатьяРасходов = РасшифровкаБезРазбиенияСтатьяРасходов;
	НСтр.Сумма = РасшифровкаБезРазбиенияСумма;
	НСтр.ЧленСемьи = РасшифровкаБезРазбиенияЧленСемьи;	
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	Иначе
		Объект.Списания[0].ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	КонецЕсли;                                                                        
	
КонецПроцедуры
#КонецОбласти
